import dirty from "../assets/happenings/grath.jpg";
import biomix from "../assets/happenings/biomix.jpeg";
import brokenDevices from "../assets/happenings/broken-devices.jpg";
import trashOcean from "../assets/happenings/trashicocean.jpg";
import pollutionAir from "../assets/happenings/polluitonair.jpg";
import warningHealth from "../assets/happenings/warningforhealthpeople.jpg";
import waterTrash from "../assets/happenings/water.jpg";
import changeClimat from "../assets/happenings/zmina-klimatu.jpg";

interface dataFromSiteSIP {
  nameOfSite: string;
  url: string;
}

export interface happeningsDataIP {
  source: string;
  title: string;
  route: string;
  maininfo: string;
  subinfo: string;
  images: string[];
  dataFromSite: dataFromSiteSIP[];
  listOFPollutions?: string[];
}

export const happeningsData: happeningsDataIP[] = [
  {
    source: changeClimat,
    title: "Кліматичні зміни",
    route: "/happenings/0",
    dataFromSite: [
      {
        nameOfSite: "wikipediaUA",
        url: "https://uk.wikipedia.org/wiki/Зміна_клімату#:~:text=Змі́на%20клі́мату%20—%20суттєва%20та%20тривала,від%20десятиліть%20до%20мільйонів%20років.",
      },
    ],
    maininfo:
      "Змі́на клі́мату — суттєва та тривала зміна у статистичному розподілі погодних умов протягом тривалих проміжків часу: від десятиліть до мільйонів років. Це може бути зміна в середніх погодних умовах, або у розподілі погоди навколо середніх умов (наприклад, часті або рідкі екстремальні погодні явища). Чинниками зміни клімату є біотичні процеси, коливання сонячної радіації, тектоніка плит та виверження вулканів. Деякі види діяльності людини також виділяють як потужні чинники недавньої зміни клімату, яку часто називають «глобальним потеплінням». Зміна клімату загрожує основним умовам життя: горять ліси, тануть льодовики та руйнується біорізноманіття.",
    subinfo:
      "Науковці активно працюють, щоб зрозуміти який був клімат у минулому та буде у майбутньому за допомогою спостережень[en] та теоретичного моделювання. Історичні кліматичні дані — занурення у минуле Землі — були відтворені, та й досі триває їх накопичення з геологічних зразків з свердловин, кернів з глибоких шарів льоду, залишків флори та фауни, гляціальних та перигляціальних процесів, стабільних ізотопів та інших методів аналізу осаду, та слідів минулих рівнів моря. Новітні дані збираються за допомогою інструментальних записів. Моделі загальної циркуляції, побудовані за принципами природничих наук, часто використовуються у теоретичних підходах для зіставлення з даними клімату у минулому, щоб прогнозувати та виявляти причинно-наслідкові зв'язки в зміні клімату.",
    images: [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Vostok_Petit_data.svg/350px-Vostok_Petit_data.svg.png",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/6/60/Solar_Activity_Proxies.png/220px-Solar_Activity_Proxies.png",
    ],
  },
  {
    source: biomix,
    title: "Втрата Біорізноманіття",
    route: "/happenings/1",
    maininfo:
      "Втрата біорізноманіття включає всесвітнє зникнення різних видів, а також локальне скорочення або втрату видів у певному середовищі існування, що призводить до втрати біологічного різноманіття. Останнє явище може бути тимчасовим або постійним, залежно від того, чи є деградація довкілля, яка може бути оборотною через екологічне відновлення / екологічну стійкість або фактично постійною (наприклад, через втрату землі). Нинішнє глобальне вимирання (часто називають шостим масовим вимиранням або антропоценовим вимиранням) призвело до кризи біорізноманіття, викликаної діяльністю людини, яка виходить за планетарні межі і поки що це виглядає як незворотній процес",
    subinfo:
      "Незважаючи на те, що постійна глобальна втрата видів є більш драматичним і трагічним явищем, ніж регіональні зміни у складі видів, навіть незначні зміни від здорового стабільного стану можуть мати драматичний вплив на харчову мережу та харчовий ланцюг, оскільки скорочення лише одного виду може негативно вплинути на весь ланцюг (співвимирання), що призводить до загального скорочення біорізноманіття, незважаючи на можливі альтернативні стабільні стани екосистеми. Зменшення біорізноманіття, зокрема, призводить до зменшення екосистемних послуг і в кінцевому підсумку створює безпосередню загрозу для продовольчої безпеки, але також може мати й більш тривалі наслідки для здоров’я людей",
    dataFromSite: [
      {
        nameOfSite: "wikiUA",
        url: "https://uk.wikipedia.org/wiki/Втрата_біорізноманіття#:~:text=Втрата%20біорізноманіття%20включає%20всесвітнє%20зникнення,призводить%20до%20втрати%20біологічного%20різноманіття.",
      },
    ],
    images: [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Summary_of_major_environmental-change_categories_expressed_as_a_percentage_change_%28red%29_relative_to_baseline_-_fcosc-01-615419-g001.jpg/220px-Summary_of_major_environmental-change_categories_expressed_as_a_percentage_change_%28red%29_relative_to_baseline_-_fcosc-01-615419-g001.jpg",
    ],
  },
  {
    source: waterTrash,
    title: "Забруднення Водних Ресурсів",
    route: "/happenings/2",
    maininfo:
      "Забруднення поверхневих вод – це істотне зниження якості водних ресурсів через попадання в струмки, річки, озера, моря та океани різних хімічних речовин, твердих відходів або розмноження в них мікроскопічних живих організмів (бактерій, грибів, водоростей).",
    subinfo:
      "Однією з причин незадовільного екологічного та санітарного стану поверхневих, а також підземних вод є тривале забруднення їх неочищеними або недостатньо очищеними зворотними водами каналізаційних і очисних споруд, ефективністьроботи яких є вагомим в містах і селищах перебувають в незадовільному санітарно – технічному станів ,а деякі населені пункти взагалі не забезпечені централізованою системою каналізації.Другим основним джерелом забруднення є нафта і нафтопродукти . Сучасна цивілізація критично залежить від нафти: вона є і джерелом енергії, і найважливішою сировиною для хімічної промисловості .Крім забруднення поверхні вод, вонаперекриває доступ кисню і світла ,що нерідко призводить до масової загибелі риби та інших мешканців глибин . Забруднення води нафтопродуктами – одна з найбільш гострих екологічних проблем сучасності.",
    images: [
      "https://vorokhtianska-rada.gov.ua/wp-content/uploads/2022/12/1506334382_horrifying-water-pollution-fa-1.webp",
    ],
    dataFromSite: [
      {
        nameOfSite: "Ворохнятяньска рада -- стаття",
        url: "https://vorokhtianska-rada.gov.ua/novyny/https-vorokhtianska-rada-gov-ua-pres-czentr-czentr-kontrolyu-ta-profilaktyky-hvorob-moz-ukrayiny/zabrudnennya-poverhnevyh-vodojm/#:~:text=Забруднення%20поверхневих%20вод%20–%20це%20істотне,бактерій%2C%20грибів%2C%20водоростей).",
      },
    ],
  },
  {
    source: pollutionAir,
    title: "Забруднення Повітря",
    route: "/happenings/3",
    dataFromSite: [
      {
        nameOfSite: "wikiUA",
        url: "https://uk.wikipedia.org/wiki/Забруднення_повітря",
      },
    ],
    images: [
      "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Alfred_Palmer_Smokestacks.jpg/300px-Alfred_Palmer_Smokestacks.jpg",
      "https://upload.wikimedia.org/wikipedia/commons/thumb/0/04/Santiago30std.jpg/305px-Santiago30std.jpg",
    ],
    maininfo:
      "Забру́днення атмосфе́рного пові́тря — один з основних типів антропогенного забруднення. Полягає у викиді в атмосферу хімічних речовин, твердих частинок і біологічних матеріалів, здатних викликати шкоду для людини та інших живих організмів. Часто ефект забруднювачів є непрямим та проявляється лише через тривалий час, наприклад, певні речовини здатні зменшувати товщину озонового шару, впливаючи таким чином на більшість земних екосистем.Забруднення повітря відбувається шляхом природних і антропогенних джерел. До природних можна віднести пилові бурі, пожежі в лісах, степах.",
    subinfo:
      "Світове господарство щорічно викидає в атмосферу більше 15 млрд т вуглекислого газу, 200 млн т оксиду вуглецю, понад 500 млн т вуглеводнів, 120 млн т золи та ін. Загальний обсяг викидів забруднюючих речовин в атмосферу становить більше 19 млрд т.Основними забруднюючими речовинами, які надходять в атмосферу при спалюванні палива, є тверді частинки (попіл, сажа), оксиди сірки (SO2 і SO3), оксиди азоту (NO і NO2) При неповному згорянні палива в газоподібних викидах можуть накопичуватися оксиди вуглецю (СО), вуглеводні типу СН4, С2Н4, поліциклічні ароматичні вуглеводні, бензапірен (С20Н12), а також п'ятиокис ванадію (V2O5). Останні дві сполуки належать до класу надзвичайно небезпечних. Діоксид (SO2) і триоксид (SO3) сірки є головними компонентами забруднення природного середовища при спалюванні палива.",
  },
  {
    source: dirty,
    title: "Отруєння ґрунту",
    route: "/happenings/4",
    maininfo:
      "Забру́днення ґрунті́в — вид антропогенної трансформації ґрунтів, при якій вміст хімічних речовин у ґрунтах, які піддаються антропогенному впливу, перевищує природний регіональний рівень їх вмісту у ґрунтах.Розрізняють три ступені забруднення, що вимагають наступних дій:профілактика,перебудова,припинення використання ґрунтів.При надходженні в ґрунти доз важких металів, що не обумовлюють перевищень гранично допустимих концентрацій (ГДК), рекомендується проведення профілактичних заходів та здійснення моніторингу стану ґрунтів і рослин.",
    subinfo:
      "При надходженні в ґрунти доз важких металів, що не обумовлюють перевищень гранично допустимих концентрацій (ГДК), рекомендується проведення профілактичних заходів та здійснення моніторингу стану ґрунтів і рослин.У тих випадках, коли в ґрунтах і в деяких рослинах перевищуються ГДК та є небезпека для здоров'я людей, рекомендується застосовувати меліоративні, агрономічні, селекційні заходи та розробляти організацію раціонального використання забруднених земель. Для зменшення рухомості важких металів і переходу їх до фітоценозів кислі ґрунти вапнують, лужні гіпсують, використовують фосфорні і органічні добрива, вносять іонообмінні речовини (цеоліти, гранули полістиролу, кремнійорганічні сполуки), підбирають рослини, які найменш вбирають важкі метали, наприклад — льон, коноплі.",
    dataFromSite: [
      {
        nameOfSite: "wikiUA",
        url: "https://uk.wikipedia.org/wiki/Забруднення_ґрунту#:~:text=Забру́днення%20ґрунті́в%20—%20вид%20антропогенної%20трансформації,рівень%20їх%20вмісту%20у%20ґрунтах.",
      },
    ],
    images: [""],
  },
  {
    source: trashOcean,
    title: "Сміттєзабруднення Океанів",
    route: "/happenings/5",
    maininfo:
      "Забру́днення океа́нів — глобальний процес у Світовому океані, пов'язаний із надходженням до його акваторії значної кількості антропогенних забруднювальних речовин (нафтові вуглеводи, біогенні речовини, пестициди, важкі метали, радіонукліди та ін.)[1].Під «забрудненням океану» розуміється пряме або побічне надходження речовин чи енергії в морське середовище, що несуть такі негативні впливи, як завдання шкоди живим ресурсам, небезпека для здоров'я людей, перешкоди морській діяльності, включаючи рибальство, погіршення якості морської води",
    subinfo:
      "Найбільш забруднені ґрунти відводять під залісення. Відповідно до статті 84 Земельного кодексу України, власники землі та землекористувачі, в тому числі орендарі, зобов'язані здійснювати захист земель від забруднення відходами виробництва, хімічними і радіоактивними речовинами. Для цього необхідно знати їх просторовий розподіл в межах відповідних земельних масивів. Традиційно це завдання вирішується шляхом відбору деякої кількості проб ґрунту та зразків фітоценозів в межах кожного з них для подальшого аналізу, наприклад, рентгенофлуоресцентним методом. Необхідна кількість проб, зазвичай, визначається для кожного випадку з вимог задоволення умовам репрезентативності їх статистик.",
    dataFromSite: [
      {
        nameOfSite: "wikiUA",
        url: "https://uk.wikipedia.org/wiki/Забруднення_океанів",
      },
    ],
    listOFPollutions: [
      "Фізичне — нерозчинні домішки: глина, пісок, намул, пил тощо;",
      "Хімічне — важкі метали, кислоти, луги, мінеральні солі, нафта і нафтопродукти, синтетичні поверхнево-активні речовини (СПАР), мийні засоби, канцерогени, мінеральні добрива, пестициди;",
      "Біологічне — різні мікроорганізми (бактерії, віруси), яйця гельмінтів, спори грибів;",
      "Радіоактивне — радіонукліди (цезій-137, стронцій-90, калій-40 тощо);",
      "Теплове — підігріті води ТЕС та АЕС[2].",
    ],
    images: [
      "https://ukr.media/static/ba/aimg/4/0/2/402897_1.jpg",
      "https://www.volynnews.com/files/news/2017/10-23/229791/smitia_okean2.jpg",
    ],
  },
  {
    source: brokenDevices,
    title: "Електронне Забруднення",
    route: "/happenings/6",
    maininfo:
      "Людство живе в середовищі, пронизаному електромагнітними полями (ЕМП). Електромагнітне випромінювання має як природне, так і антропогенне походження. Природні електромагнітні поля – це магнітне поле Землі та космічне випромінювання, які впливають на нас постійно.",
    subinfo:
      "Антропогенні електромагнітні випромінювання (ЕМВ) мають повсюдне поширення у зв’язку з упровадженням нової техніки, що працює в найрізноманітніших частотних діапазонах і режимах. Це призводить як до зростання рівня ЕМП, так і до значного зростання опромінюваного контингенту населення. На особливу увагу заслуговує значне поширення телевізорів, комп’ютерів, збільшення повітряних ліній електропередач високої та надвисокої напруги, інтенсивне розширення засобів радіозв’язку, радіомовлення, радіолокаційні станції, електротранспорту, використання побутової та офісної техніки, зокрема стільникових телефонів.",
    dataFromSite: [
      {
        nameOfSite: "amnu",
        url: "https://amnu.gov.ua/elektromagnitne-zabrudnennya-u-velykyh-mistah-ukrayiny",
      },
    ],
    images: ["https://amnu.gov.ua/wp-content/uploads/2023/05/eko2-696x513.jpg"],
    listOFPollutions: [
      "1-ша група – джерела, що генерують вкрай низькі та наднизькі частоти від 0 Гц до 3 кГц;",
      "2-а група – джерела, що генерують випромінювання в радіочастотному діапазоні від 3 кГц до 300 ГГц, включно з мікрохвилями (НВЧ-випромінювання) в діапазоні від 300 МГц до 300 ГГц.",
    ],
  },
  {
    source: warningHealth,
    title: "Загроза Здоров'ю Людей",
    route: "/happenings/7",
    maininfo:
      "Забруднення повітря стало серйозною загрозою для здоров'я людей, наслідки якої відчутні на фізичному та психічному рівнях. Це явище, викликане викидами токсичних речовин у повітря з різних джерел, має широкий спектр негативних впливів, які можуть призводити до серйозних захворювань та загрози загальному благополуччю.",
    subinfo: "",
    images: [
      "https://images.unian.net/photos/2016_03/thumb_files/1200_0_1459349592-3721.jpg",
      "https://day.kyiv.ua/sites/default/files/main/articles/08052022/2hxem0a.max-760x504.jpg",
    ],
    dataFromSite: [
        {
            nameOfSite: "cgz.vn",
            url: 'http://cgz.vn.ua/nformatsya-dlya-naselennya/nformatsya-dlya-naselennya_485.html'
        }
    ]
  },
];
