import { organisationIP } from "./companies";

export const activists: organisationIP[] = [
    {
        link: 'https://uk.wikipedia.org/wiki/Ґрета_Тунберг',
        text: 'Молода шведська активістка, яка стала голосом міжнародного руху за боротьбу з кліматичними змінами. Своїми пристрасними виступами та стачками вона наголошує на необхідності негайних заходів для зменшення викидів газів, що сприяють парниковому ефекту.',
        nameOfOrganistaon: 'Ґрета Тунберг'
    },
    {
        nameOfOrganistaon:'Леонардо Ді Капріо',
        text: "Відомий актор та активіст, який вкладає зусилля в розуміння та розв'язання екологічних проблем. Він заснував Фонд Леонардо Ді Капріо для охорони довкілля та підтримує проекти, спрямовані на зменшення забруднення та збереження природних резервів.",
        link: 'https://uk.wikipedia.org/wiki/Леонардо_Ді_Капріо'
    },
    {
        nameOfOrganistaon: 'Elon Musk',
        text: 'Підприємець та винахідник, засновник компаній SpaceX і Tesla. Він працює над винайденням технологій, що дозволять переходити на альтернативні джерела енергії та зменшити використання паливного споживання.',
        link: 'https://uk.wikipedia.org/wiki/Ілон_Маск',
    },
    {
        nameOfOrganistaon: 'Джейн Гудолл',
        text: 'Світово-відома приматологиня та антропологиня, яка проводила дослідження над шимпанзе. Вона є активісткою за охорону природи та веде кампанії для збереження біорізноманіття та природних екосистем.',
        link: 'https://uk.wikipedia.org/wiki/Джейн_Гудолл'
    },
    {
        nameOfOrganistaon: 'Альберт Ґор',
        text: 'Політик та екс-віце-президент Сполучених Штатів, який відомий своєю роботою у сфері кліматичних змін. Автор фільму "Некерований правдивий облік", в якому він наголошує на важливості зменшення викидів парникових газів.',
        link: 'https://uk.wikipedia.org/wiki/Альберт_Ґор'
    }
]