import pollutionImg from '../assets/pollution.svg'


interface variantsComponent {
    main: string,
    sub: string,
    source: string,
    alt: string
}

const subTextFirst = 'Одним з основних аспектів забруднення навколишнього середовища є викид сміття у водні джерела. Ця дія завдає невідновного шкоди екосистемам та водним ресурсам. Сміття, викинуте у воду, розкладається повільно, забруднюючи воду та загрожуючи життю багатьох видів риб та інших морських організмів.'

// const subTextSecond = 'Одним з основних аспектів забруднення навколишнього середовища є викид сміття у водні джерела. Ця дія завдає невідновного шкоди екосистемам та водним ресурсам. Сміття, викинуте у воду, розкладається повільно, забруднюючи воду та загрожуючи життю багатьох видів риб та інших морських організмів.'

// const subTextThird = 'У довкілля потрапляє величезна кількість пластикових відходів; Так, дослідження припускають, що тіла 90% морських птахів містять у собі пластик. Існує дуже багато видів та форм пластикового забруднення. Пластикове забруднення негативно впливає на земну поверхню, водні шляхи та океани.'
// const subTextFour = 'Одним з основних аспектів забруднення навколишнього середовища є викид сміття у водні джерела. Ця дія завдає невідновного шкоди екосистемам та водним ресурсам. Сміття, викинуте у воду, розкладається повільно, забруднюючи воду та загрожуючи життю багатьох видів риб та інших морських організмів.'
// const subTextFive = 'Наслідки Теплове забруднення є причиною створення теплових островів, місцевої (штучної) інверсії температур над джерелом, що призводить до розвитку мікроциркуляцій атмосфери, зміни мікроклімату та ускладнення механізму перенесення забруднень. Виникають проблеми у річках та прибережних океанічних водах.'

export const variantsArray: variantsComponent[] = [
    {
        main: 'Забруднення води:',
        sub: subTextFirst,
        source: pollutionImg,
        alt: 'pollutionImg'
    },
]